# Curve Overlap Point Methods

Source: https://www.revitapidocs.com/2026/2c5bed8d-9151-f5c9-cb5e-0f088152d3eb.htm

---

| Curve Overlap Point Methods |
| --- |

The CurveOverlapPoint type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace